#coding:utf8
import numpy as np
from ILP import ILP
'''
数据块
'''
'''
探索
'''
tansuofuben = [
{"title":"第一章 雀食奇谭 ","rows":["天邪鬼绿1 天邪鬼绿×1 灯笼鬼×2","天邪鬼绿1(困难) 天邪鬼绿×1 跳跳犬×2","天邪鬼绿2 天邪鬼绿×1 提灯小僧×2","提灯小僧1 天邪鬼绿×2 提灯小僧×1","提灯小僧2 提灯小僧×1 灯笼鬼×2","首领：九命猫 九命猫×3","挑战 天邪鬼绿×14 九命猫×14"]},

{"title":"第二章 幸福的彼岸 ","rows":["帚神 盗墓小鬼×1 寄生魂×1 帚神×1","盗墓小鬼1 盗墓小鬼×1 寄生魂×2","盗墓小鬼2 盗墓小鬼×1 灯笼鬼×2","寄生魂1 寄生魂×1 灯笼鬼×2","寄生魂2 盗墓小鬼×2 寄生魂×1","首领：座敷童子 座敷童子×1 天邪鬼绿×2 天邪鬼青×1","挑战 提灯小僧×14 座敷童子×14"]},

{"title":"第三章 凤凰林的占卜师 ","rows":["天邪鬼黄1 天邪鬼黄×1 帚神×2 涂壁×1","天邪鬼黄2 天邪鬼黄×1 童女×3","赤舌1 赤舌×1 提灯小僧×1 灯笼鬼×2 鸦天狗×1","赤舌2 赤舌×1 天邪鬼黄×1 童女×2 鸦天狗×1","兵俑1 兵俑×1 提灯小僧×1 童女×2","兵俑1(困难) 兵俑×1 提灯小僧×2 童女×1","兵俑2 兵俑×1 提灯小僧×1 灯笼鬼×2","首领：凤凰火 凤凰火×1 寄生魂×3","挑战 天邪鬼黄×14 铁鼠×14 三尾狐×14"]},

{"title":"第四章 桥上的雨女 ","rows":["帚神1 帚神×1 涂壁×2","帚神2 帚神×1 涂壁×1 唐纸伞妖×2","帚神2(困难) 帚神×1 唐纸伞妖×3","唐纸伞妖1 唐纸伞妖×1 天邪鬼赤×3","唐纸伞妖2 唐纸伞妖×1 天邪鬼赤×1 涂壁×2","唐纸伞妖2(困难) 唐纸伞妖×1 涂壁×3","天邪鬼赤1 天邪鬼赤×1 唐纸伞妖×1 涂壁×2","天邪鬼赤1(困难) 天邪鬼赤×1 涂壁×3","天邪鬼赤2 天邪鬼赤×1 唐纸伞妖×2","首领：雨女 雨女×1 青蛙瓷器×1 帚神×2","挑战 雨女×14 青蛙瓷器×14 管狐×14"]},

{"title":"第五章 黑夜山的食发鬼 ","rows":["涂壁1 涂壁×1 天邪鬼赤×2 黑豹×1","涂壁1(困难) 涂壁×1 天邪鬼赤×2","涂壁2 涂壁×1 天邪鬼赤×3","帚神1 帚神×1 天邪鬼赤×1 涂壁×2","帚神2 帚神×1 天邪鬼赤×1 天邪鬼黄×2","管狐1 管狐×2 天邪鬼黄×2 寄生魂×1","管狐2 管狐×1 天邪鬼绿×3 寄生魂×1","首领：食发鬼 食发鬼×1 灯笼鬼×1 天邪鬼青×2","挑战 帚神×14 食发鬼×14"]},

{"title":"第六章 似梦非梦 ","rows":["灯笼鬼1 灯笼鬼×1 帚神×3","灯笼鬼2 灯笼鬼×1 帚神×3","天邪鬼青1 天邪鬼青×1 天邪鬼绿×3","天邪鬼青2 天邪鬼青×1 天邪鬼绿×3","蝴蝶精1 蝴蝶精×1 涂壁×1 天邪鬼赤×2 三尾狐×1","蝴蝶精2 蝴蝶精×1 涂壁×1 天邪鬼赤×2 三尾狐×1","首领：巫蛊师 巫蛊师×1 天邪鬼绿×3","挑战 灯笼鬼×14 巫蛊师×14 蝴蝶精×14"]},

{"title":"第七章 恋上鲤的美 ","rows":["鲤鱼精1 鲤鱼精×3 帚神×1","鲤鱼精2 鲤鱼精×1 帚神×3","河童1 河童×1 鲤鱼精×1 涂壁×2","河童2 河童×1 灯笼鬼×1 跳跳犬×2","提灯小僧1 提灯小僧×1 跳跳犬×3 管狐×1","提灯小僧2 提灯小僧×1 跳跳犬×3 管狐×1","提灯小僧3 提灯小僧×1 跳跳犬×1 鲤鱼精×2","首领：妖狐 妖狐×1 涂壁×1 座敷童子×2 妖狐×1 寄生魂×1 天邪鬼赤×2","挑战 天邪鬼赤×14 鲤鱼精×14 河童×14"]},

{"title":"第八章 樱与桃 ","rows":["唐纸伞妖1 唐纸伞妖×1 帚神×3","唐纸伞妖2 唐纸伞妖×1 山童×1 帚神×2","樱花妖1 樱花妖×1 帚神×1 涂壁×2 雪女×1","樱花妖2 樱花妖×1 涂壁×3 雪女×1","天邪鬼绿 天邪鬼绿×1 天邪鬼青×1 天邪鬼黄×2","首领：桃花妖	樱花妖×1 天邪鬼青×1 提灯小僧×2 桃花妖×1 帚神×1 蝴蝶精×2","挑战 唐纸伞妖×14 桃花妖×14"]},
{"title":"第九章 兔蛙茶和锅 ","rows":["提灯小僧1 提灯小僧×1 灯笼鬼×3","提灯小僧2 提灯小僧×1 灯笼鬼×1 铁鼠×2","铁鼠1 铁鼠×1 帚神×3","铁鼠2 铁鼠×2 帚神×2","山兔1 山兔×4 鸦天狗×1","山兔2 山兔×3 铁鼠×1 鸦天狗×1","首领：孟婆	孟婆×1 饿鬼×3 孟婆×1 灯笼鬼×1 鸦天狗×2","挑战 天邪鬼青×14 山兔×14"]},

{"title":"第十章 鬼为谁买醉 ","rows":["丑时之女1 丑时之女×1 傀儡师×1 天邪鬼青×2","丑时之女2 丑时之女×1 傀儡师×1 天邪鬼青×2","傀儡师1 傀儡师×1 觉×1 狸猫×2","傀儡师2 傀儡师×1 觉×1 座敷童子×2 犬神×1","觉1 觉×1 狸猫×3","觉2 觉×1 赤舌×1 座敷童子×2 犬神×1","首领：酒吞童子 酒吞童子×1 跳跳哥哥×1 食发鬼×2 酒吞童子×1 兵俑×1 骨女×2","挑战 武士之灵×14 丑时之女×14"]},

{"title":"第十一章 染红了的枫叶林 ","rows":["武士之灵1 武士之灵×1 寄生魂×3","武士之灵2 武士之灵×1 独眼小僧×3","独眼小僧1 独眼小僧×1 涂壁×1 天邪鬼赤×2 独眼小僧×1","独眼小僧1(困难) 独眼小僧×1 涂壁×1 天邪鬼赤×2 独眼小僧×1","独眼小僧2 独眼小僧×1 管狐×1 天邪鬼赤×2 独眼小僧×1","独眼小僧2(困难) 独眼小僧×1 管狐×1 天邪鬼赤×2 独眼小僧×1","饿鬼1 饿鬼×1 涂壁×1 管狐×2","饿鬼2 饿鬼×3 管狐×1","首领：鬼女红叶 鬼女红叶×1 童女×1 天邪鬼青×2 鬼女红叶×1 骨女×1 觉×2","挑战 寄生魂×14 饿鬼×14"]},

{"title":"第十二章 另一个晴明 ","rows":["海坊主1 海坊主×1 帚神×1 涂壁×2","海坊主2 海坊主×1 涂壁×1 鸦天狗×2","童男1 童男×1 天邪鬼黄×1 鸦天狗×2","童男2 童男×1 童女×1 鸦天狗×2","童女1 童女×1 盗墓小鬼×1 提灯小僧×2 雪女×1","童女2 童女×3 盗墓小鬼×1 雪女×1","首领：雪女 雪女×1 寄生魂×1 武士之灵×2 雪女×1 跳跳妹妹×1 跳跳哥哥×2","挑战 童男×14 童女×14"]},

{"title":"第十三章 箭与弓道 ","rows":["饿鬼1 饿鬼×1 天邪鬼赤×3","饿鬼2 饿鬼×1 天邪鬼赤×3","饿鬼3 饿鬼×1 天邪鬼赤×3 首无×1","唐纸伞妖1 唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2","唐纸伞妖2 唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2","唐纸伞妖3 唐纸伞妖×1 天邪鬼赤×1 天邪鬼绿×2 首无×1","首领：首无 首无×1 骨女×1 灯笼鬼×1 山兔×1","挑战 涂壁×14 兵俑×14"]},

{"title":"第十四章 梦境的邂逅 ","rows":["帚神1 帚神×1 天邪鬼赤×3","帚神2 帚神×1 天邪鬼赤×3","帚神3 帚神×1 天邪鬼赤×3","涂壁1 涂壁×6","涂壁2 涂壁×6","涂壁3 涂壁×6 食梦貘×1","首领：食梦貘 食梦貘×1 天邪鬼赤×3 食梦貘×4","挑战 盗墓小鬼×14 狸猫×14"]},

{"title":"第十五章 阴界裂缝 ","rows":["天邪鬼绿1 天邪鬼绿×1 赤舌×1 天邪鬼赤×2","天邪鬼绿2 天邪鬼绿×1 赤舌×1 天邪鬼赤×2","天邪鬼绿3 天邪鬼绿×1 赤舌×1 天邪鬼赤×2","提灯小僧1 提灯小僧×1 赤舌×1 九命猫×2","提灯小僧2 提灯小僧×1 赤舌×1 九命猫×2","提灯小僧3 提灯小僧×1 赤舌×1 九命猫×2 大天狗×1","首领：跳跳妹妹 跳跳妹妹×1 九命猫×3","挑战 跳跳弟弟×14 跳跳妹妹×14"]},

{"title":"第十六章 冥界审判 ","rows":["饿鬼1 饿鬼×1 山兔×1 山童×2","饿鬼2 饿鬼×1 山兔×1 山童×2","饿鬼3 饿鬼×1 山兔×1 山童×2","赤舌1 赤舌×1 寄生魂×3","赤舌2 赤舌×1 寄生魂×3 赤舌×1","赤舌3 赤舌×1 寄生魂×3","首领：判官 判官×1 鬼使黑×1 鬼使白×1","挑战 赤舌×14 山童×14"]},

{"title":"第十七章 阴阳逆反 ","rows":["鸦天狗1 鸦天狗×1 风小麒麟×3","鸦天狗2 鸦天狗×1 风小麒麟×3","鸦天狗3 鸦天狗×1 风小麒麟×3","狸猫1 狸猫×1 火小麒麟×3","狸猫2 狸猫×1 火小麒麟×3","狸猫3 狸猫×1 火小麒麟×3 黑凤凰×1","首领：荒川之主 荒川之主×1 灯笼鬼×1 骨女×1 山兔×1","挑战 萤草×14 鸦天狗×14"]},

{"title":"第十八章 阴阳之理 ","rows":["九命猫1 九命猫×6","九命猫2 九命猫×6","九命猫3 九命猫×6","三尾狐1 三尾狐×2 九命猫×2 大天狗×1","三尾狐2 三尾狐×2 九命猫×2","三尾狐3 三尾狐×2 九命猫×2","首领：大天狗 大天狗×1 鸦天狗×3","挑战 独眼小僧×14 觉×14 镰鼬×14"]},

{"title":"第十九章 八岐大蛇的复活 ","rows":["清姬1 清姬×3 络新妇×2 二口女×1","清姬2 清姬×1 二口女×3","络新妇1 络新妇×3 清姬×3","络新妇2 络新妇×2 清姬×2","二口女1 二口女×1 络新妇×4","二口女2 二口女×4","二口女3 古笼火×1 二口女×3 络新妇×2","首领：八百比丘尼 八百比丘尼×1 暗孔雀×2 清姬×2 二口女×1"]},

{"title":"第二十章 赌上性命的仪式 ","rows":["般若1 般若×4","般若2 般若×1 古笼火×3 凤凰火×1","般若3 般若×1 古笼火×3 清姬×2","古笼火1 古笼火×1 清姬×1 二口女×2","古笼火2 古笼火×1 般若×4 二口女×1","清姬1 清姬×1 般若×3","清姬2 清姬×1 古笼火×5","首领：妖刀姬 妖刀姬×1 二口女×1 般若×2 古笼火×2"]},

{"title":"第二十一章 七角山秘闻 ","rows":["烟烟罗1 武士之灵×3 烟烟罗×1","烟烟罗2 武士之灵×2 兵俑×1 烟烟罗×1","食发鬼1 丑时之女×3 食发鬼×1","食发鬼2 丑时之女×2 兵俑×1 食发鬼×1","食发鬼3 丑时之女×2 兵俑×1 食发鬼×1","吸血姬1 跳跳弟弟×3 吸血姬×1 夜叉×1","吸血姬2 跳跳弟弟×2 武士之灵×1 吸血姬×1 夜叉×1","首领：萤草 萤草×2 烟烟罗×4 吸血姬×2","首领：萤草（困难） 萤草×2 烟烟罗×4 吸血姬×1 夜叉×1"]},

{"title":"第二十二章 八岐大蛇的秘谋 ","rows":["络新妇1 络新妇×1 烟烟罗×2 般若×1","络新妇2 烟烟罗×2 络新妇×1 二口女×1","络新妇3 二口女×3 络新妇×1","青坊主1 二口女×2 青坊主×1 烟烟罗×1","青坊主2 青坊主×1 般若×3","二口女1 二口女×3 烟烟罗×1 络新妇×1","二口女2 二口女×2 烟烟罗×2 青坊主×1","首领：络新妇 酒吞童子×1 二口女×2 般若×1 络新妇×1 椒图×1 惠比寿×1 吸血姬×1"]},

{"title":"第二十三章 沉睡的傀儡师 ","rows":["孟婆1 山兔×3 孟婆×1","孟婆2 山兔×3 孟婆×1","孟婆3 山兔×3 孟婆×1","盗墓小鬼1 座敷童子×2 河童×1 盗墓小鬼×1","盗墓小鬼2 座敷童子×2 河童×1 盗墓小鬼×1","骨女1 赤舌×3 骨女×1","骨女2 赤舌×3 骨女×1","首领：傀儡师 盗墓小鬼×3 傀儡师×1 萤草×3 傀儡师×1"]},

{"title":"第二十四章 祭品巫女·前编 ","rows":["络新妇1 跳跳哥哥×3 络新妇×1","清姬1 鬼使黑×2 鬼使白×1 清姬×1","吸血姬1 海坊主×3 吸血姬×1","清姬2 鬼使黑×2 鬼使白×1 清姬×1","吸血姬2 海坊主×3 吸血姬×1","清姬3 鬼使黑×2 鬼使白×1 清姬×1 清姬×1","络新妇2 跳跳哥哥×3 络新妇×1","首领 骨女×1 络新妇×1 鬼使白×1 清姬×1"]},

{"title":"第二十五章 祭品巫女·后编 ","rows":["巫蛊师1 般若×2 九命猫×1 巫蛊师×1","巫蛊师2 武士之灵×2 独眼小僧×1 巫蛊师×1","以津真天1 古笼火×2 烟烟罗×1 以津真天×1","以津真天2 独眼小僧×2 蝴蝶精×1 以津真天×1","兵俑1 山兔×2 椒图×1 兵俑×1","兵俑2 山兔×2 椒图×1 兵俑×1","兵俑3 鸦天狗×3 兵俑×1","首领 骨女×1 清姬×1 妖刀姬×1 鸩×1"]},

{"title":"第二十六章 决战的终章 ","rows":["百目鬼1 兔丸×2 萤草×1 百目鬼×1","觉1 萤草×1 虫师×1 夜叉×1 觉×1","首无1 虫师×2 寄生魂×1 首无×1","首无2 虫师×2 寄生魂×1 首无×1","觉2 萤草×1 虫师×1 夜叉×1 觉×1","百目鬼2 兔丸×2 萤草×1 百目鬼×1","百目鬼3 兔丸×2 萤草×1 百目鬼×1","首领 万年竹×1 夜叉×1 追月神×1 荒×1"]},
{"title":"第二十七章 深海的孤独 ","rows":["金鱼姬1 海坊主×3 金鱼姬×1","金鱼姬2 海坊主×3 金鱼姬×1","鲤鱼精1 河童×3 鲤鱼精×1","河童1 鲤鱼精×3 河童×1","河童2 鲤鱼精×3 河童×1","海坊主1 傀儡师×3 海坊主×1","海坊主2 傀儡师×3 海坊主×1","首领化鲸 夜叉×3 化鲸×1"]},
{"title":"第二十八章 少女与面具 ","rows":["跳跳妹妹1 跳跳犬×3 跳跳妹妹×1","傀儡师1 傀儡师×3 觉×1","傀儡师2 傀儡师×3 觉×1","判官1 判官×2 白童子×1 黑童子×1","荒1 跳跳妹妹×3 荒×1","阎魔1 鬼使黑×2 黑童子×1 阎魔×1","面灵气1 清姬×1 判官×1 食发鬼×1 面灵气×1","首领面灵气 鬼使黑×1 鬼使白×1 面灵气×2"]},

{"title":"番外一 见习鬼使 ","rows":["鬼女红叶1 觉×3 天邪鬼青×2 鬼女红叶×1","鬼女红叶2 觉×3 天邪鬼青×2 鬼女红叶×1","山童1 山童×1 首无×2 河童×3","山童2 山童×1 首无×2 河童×3","古笼火1 管狐×2 犬神×3 古笼火×1","古笼火2 管狐×2 犬神×3 古笼火×1","古笼火3 管狐×2 犬神×3 古笼火×1","酒吞童子(困难) 狸猫×3 首无×2 酒吞童子×1","首领：黑童子 鬼使白×1 鬼使黑×1 天邪鬼绿×3 黑童子×1"]},


]
'''
御魂
'''
yhfbData=[
{"title":"第一层 ","rows":["一回合 三尾狐×1 天邪鬼黄×1 天邪鬼青×1","二回合 山童×1 涂壁×1 独眼小僧×1","三回合 八歧大蛇×1 天邪鬼赤×2"]},
{"title":"第二层 ","rows":["一回合 妖狐×1 鲤鱼精×1 河童×1","二回合 吸血姬×1 萤草×1 兵俑×1","三回合 八歧大蛇×1 童女×2"]},
{"title":"第三层 ","rows":["一回合 桃花妖×1 蝴蝶精×1 青蛙瓷器×1","二回合 海坊主×1 鲤鱼精×1 椒图×1","三回合 八歧大蛇×1 座敷童子×2"]},
{"title":"第四层 ","rows":["一回合 犬神×1 童男×1 童女×1","二回合 大天狗×1 鬼使黑×1 鬼使白×1","三回合 八歧大蛇×1 食梦貘×2"]},
{"title":"第五层 ","rows":["一回合 镰鼬×1 骨女×1 丑时之女×1","二回合 傀儡师×1 跳跳哥哥×1 独眼小僧×1","三回合 八歧大蛇×1 孟婆×2"]},
{"title":"第六层 ","rows":["一回合 雨女×1 孟婆×1 座敷童子×1","二回合 阎魔×1 巫蛊师×1 鸦天狗×1","三回合 八歧大蛇×1 骨女×2"]},
{"title":"第七层 ","rows":["一回合 丑时之女×1 凤凰火×1 食发鬼×1","二回合 山兔×1 酒吞童子×1 妖琴师×1","三回合 八歧大蛇×1 荒川之主×2"]},
{"title":"第八层 ","rows":["一回合 管狐×1 判官×1 饿鬼×1","二回合 蝴蝶精×1 白狼×1 椒图×1","三回合 八歧大蛇×1 茨木童子×2"]},
{"title":"第九层 ","rows":["一回合 椒图×1 萤草×1 鲤鱼精×1","二回合 狸猫×1 清姬×1 食梦貘×1","三回合 八歧大蛇×1 两面佛×2"]},
{"title":"第十层 ","rows":["一回合 二口女×1 觉×1 萤草×1","二回合 椒图×1 青行灯×1 酒吞童子×1","三回合 八歧大蛇×1 大天狗×2"]}
]
'''
秘闻
'''
mwfbData=[
{"title":"红叶一层","rows":["一回合 管狐×4","二回合 饿鬼×4","三回合 鬼女红叶×1 觉×3"]},
{"title":"红叶二层","rows":["一回合 管狐×4","二回合 饿鬼×4","三回合 鬼女红叶×1 跳跳妹妹×1 跳跳弟弟×1 跳跳哥哥×1"]},
{"title":"红叶三层","rows":["一回合 管狐×4","二回合 饿鬼×4","三回合 鬼女红叶×1 首无×2 三尾狐×1"]},
{"title":"红叶四层","rows":["一回合 管狐×3 天邪鬼黄×1","二回合 饿鬼×3 兵俑×1","三回合 鬼女红叶×1 鸦天狗×2 丑时之女×1"]},
{"title":"红叶五层","rows":["一回合 管狐×3 天邪鬼黄×1","二回合 饿鬼×3 兵俑×1","三回合 鬼女红叶×1 铁鼠×2 骨女×1"]},
{"title":"红叶六层","rows":["一回合 管狐×3 赤舌×1","二回合 饿鬼×3 椒图×1","三回合 鬼女红叶×1 雨女×2 雪女×1"]},
{"title":"红叶七层","rows":["一回合 管狐×3 赤舌×1","二回合 饿鬼×3 椒图×1","三回合 鬼女红叶×1 吸血姬×2 狸猫×1","酒吞童子×1"]},
{"title":"红叶八层","rows":["一回合 管狐×3 独眼小僧×1","二回合 饿鬼×3 犬神×1","三回合 鬼女红叶×1 兵俑×1 椒图×1","桃花妖×1 酒吞童子×1"]},
{"title":"红叶九层","rows":["一回合 管狐×3 独眼小僧×1","二回合 饿鬼×3 犬神×1 椒图×1","三回合 鬼女红叶×1 酒吞童子×1 桃花妖×1 鸦天狗×1 椒图×1 丑时之女×1"]},
{"title":"红叶十层","rows":["一回合 管狐×3 独眼小僧×1","二回合 饿鬼×3 犬神×1 椒图×1","兵俑×1","三回合 鬼女红叶×1 酒吞童子×1 桃花妖×1","般若×1 椒图×1 吸血姬×1"]},
{"title":"妖刀一层","rows":["一回合 天邪鬼青×4","二回合 狸猫×4","三回合 妖刀姬×1 盗墓小鬼×3"]},
{"title":"妖刀二层","rows":["一回合 天邪鬼青×4","二回合 狸猫×4","三回合 妖刀姬×1 蝴蝶精×3"]},
{"title":"妖刀三层","rows":["一回合 天邪鬼青×4","二回合 狸猫×4","三回合 妖刀姬×1 雨女×3"]},
{"title":"妖刀四层","rows":["一回合 天邪鬼青×3 涂壁×1","二回合 狸猫×3 蝴蝶精×1","三回合 妖刀姬×1 三尾狐×3"]},
{"title":"妖刀五层","rows":["一回合 天邪鬼青×3 涂壁×1","二回合 狸猫×3 蝴蝶精×1","三回合 妖刀姬×1 傀儡师×1 二口女×1","骨女×1"]},
{"title":"妖刀六层","rows":["一回合 天邪鬼青×3 天邪鬼绿×1","二回合 狸猫×3 鸦天狗×1","三回合 妖刀姬×1 桃花妖×1 樱花妖×1 清姬×1"]},
{"title":"妖刀七层","rows":["一回合 天邪鬼青×3 天邪鬼绿×1","二回合 狸猫×3 鸦天狗×1","三回合 妖刀姬×1 鬼使黑×1 鬼使白×1 判官×1"]},
{"title":"妖刀八层","rows":["一回合 天邪鬼青×3 九命猫×1","二回合 狸猫×3 鲤鱼精×1 河童×1","三回合 妖刀姬×1 大天狗×1 青行灯×1"]},
{"title":"妖刀九层","rows":["一回合 天邪鬼青×3 九命猫×1","二回合 狸猫×3 鲤鱼精×1 河童×1","三回合 妖刀姬×1 大天狗×1 青行灯×1","童男×2"]},
{"title":"妖刀十层","rows":["一回合 天邪鬼青×2 九命猫×2","二回合 狸猫×3 河童×1 椒图×1 鲤鱼精×1","三回合 妖刀姬×1 妖狐×2 桃花妖×1 大天狗×1 青行灯×1"]},
{"title":"河童一层","rows":["一回合 盗墓小鬼×1 提灯小僧×3","二回合 童女×1 童男×3","三回合 河童×1 奉为达摩×1 招福达摩×1 大吉达摩×1 御行达摩×1"]},
{"title":"河童二层","rows":["一回合 盗墓小鬼×1 提灯小僧×3","二回合 独眼小僧×1 山童×3","三回合 河童×1 白童子×1 黑童子×1 座敷童子×1"]},
{"title":"河童三层","rows":["一回合 惠比寿×1 武士之灵×3","二回合 烟烟罗×1 食发鬼×3","三回合 河童×1 灯笼鬼×2 赤舌×1"]},
{"title":"河童四层","rows":["一回合 镰鼬×1 黑豹×3","二回合 萤草×1 觉×3","三回合 河童×1 丑时之女×2 兵俑×1"]},
{"title":"河童五层","rows":["一回合 天邪鬼黄×1 蝴蝶精×2 鬼女红叶×1","二回合 孟婆×1 妖琴师×2 山兔×1","三回合 河童×1 樱花妖×1 桃花妖×1","凤凰火×1"]},
{"title":"河童六层","rows":["一回合 鬼使白×1 鬼使黑×3","二回合 座敷童子×1 古笼火×3","三回合 河童×1 天邪鬼青×1 天邪鬼赤×1 天邪鬼绿×1 天邪鬼黄×1"]},
{"title":"河童七层","rows":["一回合 青行灯×1 管狐×3","二回合 茨木童子×1 首无×3","三回合 河童×1 雨女×1 判官×1","食梦貘×1"]},
{"title":"河童八层","rows":["一回合 海坊主×1 青坊主×3","二回合 荒川之主×1 吸血姬×2 椒图×1","鲤鱼精×1","三回合 河童×1 海坊主×2 椒图×1 鲤鱼精×1 荒川之主×1"]},
{"title":"河童九层","rows":["一回合 雨女×1 青蛙瓷器×3","二回合 妖狐×1 妖刀姬×1 鲤鱼精×1","跳跳妹妹×1 萤草×1","三回合 河童×1 鸦天狗×2 阎魔×1 鲤鱼精×1 大天狗×1"]},
{"title":"河童十层","rows":["一回合 兵俑×1 萤草×3","二回合 跳跳弟弟×1 小鹿男×2 桃花妖×2","椒图×1","三回合 河童×1 樱花妖×1 鲤鱼精×1 椒图×1 妖狐×1 花鸟卷×1"]},
{"title":"雨女一层","rows":["一回合 盗墓小鬼×3 唐纸伞妖×1","二回合 九命猫×3 铁鼠×1","三回合 座敷童子×3 雨女×1"]},
{"title":"雨女二层","rows":["一回合 盗墓小鬼×3 唐纸伞妖×1","二回合 九命猫×3 铁鼠×1","三回合 首无×3 雨女×1"]},
{"title":"雨女三层","rows":["一回合 盗墓小鬼×3 唐纸伞妖×1","二回合 九命猫×3 铁鼠×1","三回合 武士之灵×3 雨女×1"]},
{"title":"雨女四层","rows":["一回合 赤舌×1 唐纸伞妖×3","二回合 丑时之女×1 觉×3","三回合 骨女×4 雨女×1"]},
{"title":"雨女五层","rows":["一回合 赤舌×1 唐纸伞妖×3","二回合 丑时之女×1 觉×3","三回合 烟烟罗×4 雨女×1"]},
{"title":"雨女六层","rows":["一回合 赤舌×1 唐纸伞妖×3","二回合 丑时之女×1 觉×3","三回合 夜叉×4 雨女×1"]},
{"title":"雨女七层","rows":["一回合 巫蛊师×1 鸦天狗×3","二回合 三尾狐×1 萤草×2 蝴蝶精×1","三回合 兵俑×4 雨女×1"]},
{"title":"雨女八层","rows":["一回合 巫蛊师×1 鸦天狗×3","二回合 跳跳弟弟×4 椒图×1","三回合 河童×5 雨女×1"]},
{"title":"雨女九层","rows":["一回合 巫蛊师×1 鸦天狗×3","二回合 鬼使白×2 清姬×2 判官×1","三回合 管狐×5 雨女×1"]},
{"title":"雨女十层","rows":["一回合 巫蛊师×1 鸦天狗×3","二回合 吸血姬×5 童男×1","三回合 青蛙瓷器×5 雨女×1"]},
{"title":"荒川一层","rows":["一回合 赤舌×1 灯笼鬼×3","二回合 武士之灵×1 寄生魂×3","三回合 盗墓小鬼×3 荒川之主×1"]},
{"title":"荒川二层","rows":["一回合 赤舌×1 灯笼鬼×3","二回合 武士之灵×1 寄生魂×3","三回合 童女×3 荒川之主×1"]},
{"title":"荒川三层","rows":["一回合 赤舌×1 灯笼鬼×3","二回合 武士之灵×1 寄生魂×3","三回合 管狐×3 荒川之主×1"]},
{"title":"荒川四层","rows":["一回合 鲤鱼精×1 河童×3","二回合 海坊主×1 蝴蝶精×3","三回合 鸦天狗×4 荒川之主×1"]},
{"title":"荒川五层","rows":["一回合 鲤鱼精×1 河童×3","二回合 海坊主×1 蝴蝶精×3","三回合 山兔×4 荒川之主×1"]},
{"title":"荒川六层","rows":["一回合 鲤鱼精×1 河童×3","二回合 海坊主×1 蝴蝶精×3","三回合 雪女×4 荒川之主×1"]},
{"title":"荒川七层","rows":["一回合 金鱼姬×1 古笼火×3","二回合 椒图×1 夜叉×4","三回合 清姬×4 荒川之主×1"]},
{"title":"荒川八层","rows":["一回合 金鱼姬×1 古笼火×3","二回合 惠比寿×1 夜叉×4","三回合 海坊主×5 荒川之主×1"]},
{"title":"荒川九层","rows":["一回合 金鱼姬×1 古笼火×4","二回合 烟烟罗×2 夜叉×2 荒川之主×1","三回合 石距×1"]},
{"title":"荒川十层","rows":["一回合 金鱼姬×1 古笼火×5","二回合 大天狗×1 夜叉×5","三回合 荒川之主×1 桃花妖×1 雪女×1 青行灯×1 姑获鸟×1 惠比寿×1"]},
{"title":"大天狗一层","rows":["一回合 帚神×4","二回合 三尾狐×4","三回合 首无×3 大天狗×1"]},
{"title":"大天狗二层","rows":["一回合 天邪鬼黄×1 帚神×3","二回合 三尾狐×4","三回合 狸猫×3 大天狗×1"]},
{"title":"大天狗三层","rows":["一回合 青蛙瓷器×1 帚神×3","二回合 三尾狐×4","三回合 山童×3 大天狗×1"]},
{"title":"大天狗四层","rows":["一回合 椒图×1 帚神×3","二回合 三尾狐×4","三回合 独眼小僧×1 御行达摩×4 大天狗×1"]},
{"title":"大天狗五层","rows":["一回合 椒图×1 帚神×3","二回合 秘卷书童×1 三尾狐×3","三回合 雪女×1 鸦天狗×4 大天狗×1"]},
{"title":"大天狗六层","rows":["一回合 金鱼姬×1 帚神×3","二回合 秘卷书童×1 三尾狐×3","三回合 跳跳弟弟×1 鬼使白×2 清姬×2 大天狗×1"]},
{"title":"大天狗七层","rows":["一回合 金鱼姬×1 帚神×3","二回合 镰鼬×1 夜叉×5","三回合 雨女×1 萤草×4 大天狗×1"]},
{"title":"大天狗八层","rows":["一回合 童男×1 帚神×3","二回合 大天狗×1 镰鼬×1 妖狐×4","三回合 桃花妖×5 大天狗×1"]},
{"title":"大天狗九层","rows":["一回合 童男×1 帚神×3","二回合 大天狗×1 三尾狐×1 酒吞×1","三回合 黑晴明×1 大天狗×1 雪女×1"]},
{"title":"大天狗十层","rows":["一回合 武士之灵×1 帚神×3","二回合 椒图×1 吸血姬×5","三回合 黑晴明×1 大天狗×1 雪女×1"]},
{"title":"姑获鸟一层","rows":["一回合 涂壁×1 帚神×3","二回合 蝴蝶精×1 觉×3","三回合 招福达摩×1 奉为达摩×1 御行达摩×1","姑获鸟×1"]},
{"title":"姑获鸟二层","rows":["一回合 涂壁×1 帚神×3","二回合 蝴蝶精×1 觉×3","三回合 唐纸伞妖×3 姑获鸟×1"]},
{"title":"姑获鸟三层","rows":["一回合 涂壁×1 帚神×3","二回合 蝴蝶精×1 觉×3","三回合 童男×1 童女×1 鸦天狗×2 姑获鸟×1"]},
{"title":"姑获鸟四层","rows":["一回合 天邪鬼青×1 盗墓小鬼×3","二回合 跳跳哥哥×1 跳跳妹妹×1 跳跳弟弟×2","三回合 凤凰火×1 鸩×1 以津真天×1 大天狗×1 姑获鸟×1"]},
{"title":"姑获鸟五层","rows":["一回合 天邪鬼青×1 盗墓小鬼×3","二回合 跳跳哥哥×1 跳跳妹妹×1 跳跳弟弟×2","三回合 萤草×1 白狼×1 天邪鬼黄×1 灯笼鬼×1 姑获鸟×2"]},
{"title":"姑获鸟六层","rows":["一回合 天邪鬼青×1 盗墓小鬼×3","二回合 跳跳哥哥×1 跳跳妹妹×1 跳跳弟弟×2","三回合 樱花妖×1 鸩×1 鬼使白×1 跳跳弟弟×1 清姬×1 姑获鸟×1"]},
{"title":"姑获鸟七层","rows":["一回合 萤草×1 孟婆×1 白狼×2","二回合 凤凰火×1 判官×3","三回合 灯笼鬼×1 姑获鸟×5"]},
{"title":"姑获鸟八层","rows":["一回合 萤草×1 孟婆×2 白狼×2","二回合 凤凰火×1 判官×2 络新妇×2","三回合 灯笼鬼×1 桃花妖×2 酒吞童子×2 姑获鸟×2"]},
{"title":"姑获鸟九层","rows":["一回合 萤草×1 孟婆×3 白狼×2","二回合 凤凰火×1 判官×2 络新妇×3","三回合 镰鼬×1 桃花妖×1 九命猫×2 姑获鸟×2"]},
{"title":"姑获鸟十层","rows":["一回合 萤草×1 孟婆×2 白狼×2","二回合 凤凰火×1 判官×2 络新妇×2","三回合 黑童子×1 一目连×1 吸血姬×2 姑获鸟×2"]},
{"title":"镰鼬一层","rows":["一回合 蝴蝶精×1 提灯小僧×3","二回合 鬼使白×1 清姬×3","三回合 赤舌×3 镰鼬×1"]},
{"title":"镰鼬二层","rows":["一回合 食发鬼×1 天邪鬼赤×3","二回合 鬼使黑×1 古笼火×3","三回合 管狐×3 镰鼬×1"]},
{"title":"镰鼬三层","rows":["一回合 觉×1 盗墓小鬼×3","二回合 孟婆×1 巫蛊师×3","三回合 烟烟罗×3 镰鼬×1"]},
{"title":"镰鼬四层","rows":["一回合 山童×1 天邪鬼青×3","二回合 青蛙瓷器×1 帚神×3","三回合 骨女×2 九命猫×2 镰鼬×1"]},
{"title":"镰鼬五层","rows":["一回合 独眼小僧×1 鸦天狗×3","二回合 白狼×1 灯笼鬼×2 鲤鱼精×2","三回合 青行灯×4 镰鼬×1"]},
{"title":"镰鼬六层","rows":["一回合 赤舌×1 三尾狐×3","二回合 跳跳妹妹×1 小松丸×2 夜叉×2","三回合 鸩×5 镰鼬×1"]},
{"title":"镰鼬七层","rows":["一回合 妖琴师×1 跳跳弟弟×2 络新妇×2","二回合 跳跳哥哥×1 鬼女红叶×2 以津真天×2","三回合 镰鼬×2 河童×4"]},
{"title":"镰鼬八层","rows":["一回合 金鱼姬×1 判官×2 狸猫×2","二回合 椒图×1 萤草×5","三回合 二口女×5 镰鼬×1"]},
{"title":"镰鼬九层","rows":["一回合 妖狐×3 鲤鱼精×2 以津真天×1","二回合 鸦天狗×3 姑获鸟×2 万年竹×1","三回合 万年竹×1 独眼小僧×1 奉为达摩×1 犬神×1 樱花妖×1 彼岸花×1"]},
{"title":"镰鼬十层","rows":["一回合 海坊主×3 跳跳弟弟×2 花鸟卷×1","二回合 童男×2 童女×2 黑童子×1 阎魔×1","三回合 小鹿男×3 镰鼬×3"]},
{"title":"小鹿男一层","rows":["一回合 帚神×1 天邪鬼黄×3","二回合 提灯小僧×1 唐纸伞妖×3","三回合 兵俑×1 小鹿男×1"]},
{"title":"小鹿男二层","rows":["一回合 寄生魂×1 天邪鬼青×3","二回合 古笼火×1 灯笼鬼×3","三回合 鲤鱼精×1 河童×2 小鹿男×1"]},
{"title":"小鹿男三层","rows":["一回合 觉×1 天邪鬼绿×3","二回合 跳跳妹妹×1 天邪鬼赤×3","三回合 蝴蝶精×1 萤草×1 独眼小僧×1 小鹿男×1"]},
{"title":"小鹿男四层","rows":["一回合 赤舌×3 食发鬼×1","二回合 兔丸×1 帚神×3","三回合 萤草×1 跳跳弟弟×2 小鹿男×1"]},
{"title":"小鹿男五层","rows":["一回合 食发鬼×1 提灯小僧×3","二回合 兔丸×1 山童×2","三回合 萤草×1 跳跳妹妹×1 白童子×1 跳跳弟弟×1 小鹿男×1"]},
{"title":"小鹿男六层","rows":["一回合 食发鬼×4","二回合 兔丸×4","三回合 萤草×1 大天狗×1 雪女×1","匣中少女×1 小鹿男×1"]},
{"title":"小鹿男七层","rows":["一回合 食梦貘×1 食发鬼×3","二回合 傀儡师×1 兔丸×3","三回合 萤草×1 白狼×1 妖刀姬×1 黑童子×1 书翁×1 小鹿男×1"]},
{"title":"小鹿男八层","rows":["一回合 烟烟罗×1 食发鬼×3","二回合 万年竹×1 海坊主×2 兔丸×2","兵俑×1","三回合 彼岸花×1 跳跳弟弟×1 鲤鱼精×1 兵俑×1 萤草×1 小鹿男×1"]},
{"title":"小鹿男九层","rows":["一回合 烟烟罗×1 姑获鸟×1 孟婆×2 食发鬼×2","二回合 阎魔×1 白童子×1 兔丸×1","判官×1 山兔×1 黑童子​×1","三回合 金鱼姬×1 跳跳哥哥×1 萤草×1 荒×1 小松丸​×1 小鹿男×1"]},
{"title":"小鹿男十层","rows":["一回合 烟烟罗×1 食发鬼×2 白童子×2","姑获鸟×1","二回合 妖琴师×1 蝴蝶精×1 山兔×1","独眼小僧×1 兔丸×2","三回合 小鹿男×5","吸血姬×1 桃花妖×1 萤草×1 椒图×1 黑童子×1"]},
{"title":"海坊主一层","rows":["一回合 灯笼鬼×3 提灯小僧×1","二回合 帚神×3 涂壁×1","三回合 海坊主×1 天邪鬼黄×2 天邪鬼赤×1"]},
{"title":"海坊主二层","rows":["一回合 跳跳犬×3 唐纸伞妖×1","二回合 寄生魂×3 饿鬼×1","三回合 海坊主×1 座敷童子×2 椒图×1"]},
{"title":"海坊主三层","rows":["一回合 盗墓小鬼×3 河童×1","二回合 赤舌×2 鲤鱼精×1 河童×1","三回合 海坊主×1 河童×3","小鹿男×1"]},
{"title":"海坊主四层","rows":["一回合 唐纸伞妖×3 武士之灵×1","二回合 提灯小僧×2 狸猫×1 河童×1","三回合 海坊主×1 鲤鱼精×4"]},
{"title":"海坊主五层","rows":["一回合 雨女×1 天邪鬼青×1 天邪鬼黄×1","天邪鬼绿×1","二回合 雨女×2 天邪鬼赤×2 鸦天狗×1","三回合 海坊主×1 河童×5"]},
{"title":"海坊主六层","rows":["一回合 九命猫×1 二口女×1 铁鼠×1","首无×1","二回合 管狐×1 山童×2 九尾狐×2","三回合 海坊主×1 鲤鱼精×2 河童×3"]},
{"title":"海坊主七层","rows":["一回合 兵俑×1 跳跳弟弟×2 跳跳妹妹×2","二回合 夜叉×1 雨女×2 河童×2","三回合 海坊主×1 夜叉×3 鲤鱼精×1","金鱼姬×1"]},
{"title":"海坊主八层","rows":["一回合 夜叉×1 童男×1 童女×1","河童×1 首无×1","二回合 鲤鱼精×1 萤草×2 蝴蝶精×1","武士之灵×1 金鱼姬×1","三回合 海坊主×1 荒×1 玉藻前×1","镰鼬×1 辉夜姬×1"]},
{"title":"海坊主九层","rows":["一回合 河童×1 兔丸×2 鸦天狗×3","二回合 鲤鱼精×1 清姬×2 鸩×2","判官×1","三回合 海坊主×1 樱花妖×1 百目鬼×1","黑童子×3"]},
{"title":"海坊主十层","rows":["一回合 河童×1 管狐×2 金鱼姬×1","雨女×2","二回合 夜叉×1 妖琴师×1 般若×1","镰鼬×1 凤凰火×1","三回合 海坊主×1 樱花妖×1 匣中少女×1","黑童子×3"]},
{"title":"青行灯一层","rows":["一回合 跳跳犬×3 赤舌×1","二回合 涂壁×3 寄生魂×1","三回合 灯笼鬼×3 青行灯×1"]},
{"title":"青行灯二层","rows":["一回合 唐纸伞妖×3 提灯小僧×1","二回合 帚神×3 鸦天狗×1","三回合 狸猫×2 巫蛊师×1 青行灯×1"]},
{"title":"青行灯三层","rows":["一回合 赤舌×3 三尾狐×1","二回合 童男×3 童女×1","三回合 古笼火×2 数珠×1 青行灯×1"]},
{"title":"青行灯四层","rows":["一回合 天邪鬼黄×3 食发鬼×1","二回合 天邪鬼青×2 丑时之女×1 兵俑×1","三回合 觉×4 青行灯×1"]},
{"title":"青行灯五层","rows":["一回合 提灯小僧×3 跳跳弟弟×1","二回合 天邪鬼绿×2 饿鬼×2 独眼小僧×1","三回合 青蛙瓷器×2 蝴蝶妖×2 青行灯×1"]},
{"title":"青行灯六层","rows":["一回合 跳跳哥哥×3 首无×1","二回合 古笼火×2 管狐×2 山童×1","三回合 兔丸×3 鲤鱼精×2 青行灯×1"]},
{"title":"青行灯七层","rows":["一回合 觉×2 山兔×2 萤草×1","二回合 首无×2 山童×2 椒图×1","三回合 青坊主×2 妖琴师×2 姑获鸟×1","青行灯×1"]},
{"title":"青行灯八层","rows":["一回合 古笼火×2 鬼使黑×1 鬼使白×1","书翁×1","二回合 ​食梦貘×1 白狼×1 桃花妖×1","二口女×1 镰鼬×1 万年竹×1","三回合 姑获鸟×1 日和坊×1 鸩×1","白童子×1 两面佛×1 青行灯​×1"]},
{"title":"青行灯九层","rows":["一回合 山童×2 惠比寿×1 孟婆×1","小松丸×1 万年竹×1","二回合 金鱼姬×1 凤凰火×1 雨女×1","烟烟罗×1 青坊主×1 妖狐×1","三回合 日和坊×1 百目鬼×1 般若×1","椒图×1 大天狗×1 青行灯×1"]},
{"title":"青行灯十层","rows":["一回合 食发鬼×1 蝴蝶精×1 孟婆×1","吸血姬×1 骨女×1 犬神×1","二回合 清姬×1 以津真天×1 妖琴师×1","丑时之女×1 青坊主×1 金鱼姬×1","三回合 日和坊×1 椒图×1 般若×1","大天狗×1 荒×1 青行灯×1"]},
{"title":"吸血姬一层","rows":["一回合 盗墓小鬼×3 赤舌×1","二回合 壁涂×3 武士之灵×1","三回合 寄生魂×3 吸血姬×1"]},
{"title":"吸血姬二层","rows":["一回合 灯笼鬼×3 古笼火×1","二回合 帚神×3 巫蛊师×1","三回合 提灯小鬼×3 吸血姬×1"]},
{"title":"吸血姬三层","rows":["一回合 天邪鬼绿×3 河童×1","二回合 天邪鬼黄×3 狸猫×1","三回合 天邪鬼青×2 天邪鬼赤×1 吸血姬×1"]},
{"title":"吸血姬四层","rows":["一回合 赤舌×3 食法鬼×1","二回合 觉×2 丑时之女×1 管狐×1","三回合 九命猫×4 吸血姬×1"]},
{"title":"吸血姬五层","rows":["一回合 跳跳犬×3 犬神×1","二回合 鸩×2 清姬×2 以津真天×1","三回合 傀儡师×2 三尾狐×2 吸血姬×1"]},
{"title":"吸血姬六层","rows":["一回合 管狐×3 妖狐×1","二回合 小松丸×2 二口女×2 弈×1","三回合 跳跳妹妹×2 跳跳弟弟×2 跳跳哥哥×1","吸血姬×1"]},
{"title":"吸血姬七层","rows":["一回合 海坊主×2 夜叉×2 金鱼姬×1","二回合 武士之灵×2 骨女×2 兵俑×1","三回合 椒图×1 饿鬼×2 鸦天狗×2","吸血姬×1"]},
{"title":"吸血姬八层","rows":["一回合 孟婆×2 烟烟罗×2 雪童子×1","二回合 ​般若×1 鬼女红叶×2 络新妇×2","青行灯×1","三回合 黑童子×2 小鹿男×2 匣中少女×1","吸血姬×1"]},
{"title":"吸血姬九层","rows":["一回合 弈×5 妖琴师×1","二回合 鬼使白×2 清姬×2 金鱼姬×1","数珠×1","三回合 花鸟卷×1 跳跳弟弟×1 椒图×1","荒川×1 万年竹×1 吸血姬×1"]},
{"title":"吸血姬十层","rows":["一回合 青蛙瓷器×5 童男×1","二回合 鬼使白×1 鬼使黑×1 黑童子×1","白童子×1 判官×1 阎魔×1","三回合 鸩×1 日和坊×1 山风×1","樱花妖×1 雪童子×1 吸血姬×1"]},
{"title":"妖狐一层","rows":["一回合 灯笼鬼×3 提灯小僧×1","二回合 天邪鬼绿×3 天邪鬼赤×1","三回合 涂壁×3 妖狐×1"]},
{"title":"妖狐二层","rows":["一回合 盗墓小鬼×3 赤舌×1","二回合 寄生魂×3 武士之灵×1","三回合 蝴蝶精×1 妖狐×1 食发鬼×1","独眼小僧×1"]},
{"title":"妖狐三层","rows":["一回合 唐纸伞妖×3 鸦天狗×1","二回合 跳跳弟弟×3 跳跳妹妹×1","三回合 妖狐×1 小袖之手×1 兔丸×2"]},
{"title":"妖狐四层","rows":["一回合 帚神×3 雨女×1","二回合 青蛙瓷器×1 天邪鬼黄×2 首无×1","三回合 妖狐×1 山童×4"]},
{"title":"妖狐五层","rows":["一回合 天邪鬼青×3 跳跳妹妹×1","二回合 鲤鱼精×1 狸猫×2 天邪鬼赤×1","天邪鬼黄×1","三回合 妖狐×1 九命猫×2 三尾狐×2"]},
{"title":"妖狐六层","rows":["一回合 狸猫×3 兵俑×1","二回合 山兔×1 萤草×2 丑时之女×2","三回合 妖狐×1 管狐×3 饿鬼×2"]},
{"title":"妖狐七层","rows":["一回合 山童×2 座敷童子×1 椒图×1","铁鼠×1","二回合 童男×1 童女×2 河童×2","三回合 妖狐×1 妖琴师×1 座敷童子×1","姑获鸟×1 雪女×1 桃花妖×1"]},
{"title":"妖狐八层","rows":["一回合 白童子×1 黑童子×4","二回合 犬神×1 般若×1 樱花妖×1","络新妇×1 二口女×2","三回合 妖狐×1 傀儡师×2 鬼女红叶×2","骨女×1"]},
{"title":"妖狐九层","rows":["一回合 御馔津×1 山兔×5","二回合 书翁×1 小松丸×2 兔丸×2","以津真天×1","三回合 妖狐×1 百目鬼×1 跳跳弟弟×1","丑时之女×1 妖刀姬×1 食梦貘×1"]},
{"title":"妖狐十层","rows":["一回合 跳跳妹妹×1 跳跳哥哥×5","二回合 孟婆×1 姑获鸟×1 烟烟罗×1","小袖之手×1 青蛙瓷器×1 妖琴师×1","三回合 妖狐×1 海坊主×1 御馔津×1","兵俑×1 般若×1 黑童子×1"]},
{"title":"清姬一层","rows":["一回合 跳跳犬×4","二回合 跳跳犬×4 灯笼鬼×1","三回合 跳跳犬×5 清姬×1"]},
{"title":"清姬二层","rows":["一回合 盗墓小鬼×3 唐纸伞妖×1","二回合 提灯小僧×3 赤舌×1","三回合 樱花妖×4 独眼小僧×1 清姬×1"]},
{"title":"清姬三层","rows":["一回合 帚神×3 三尾狐×1","二回合 赤舌×3 武士之灵×1","三回合 灯笼鬼×1 赤舌×1 黑童子×1","座敷童子×1 三尾狐×1 清姬×1"]},
{"title":"清姬四层","rows":["一回合 三尾狐×3 武士之灵×1","二回合 饿鬼×3 巫蛊师×1","三回合 山童×3 鸦天狗×2 清姬×1"]},
{"title":"清姬五层","rows":["一回合 跳跳弟弟×3 跳跳妹妹×1","二回合 狸猫×4 兵俑×1","三回合 九命猫×4 觉×1 清姬×1"]},
{"title":"清姬六层","rows":["一回合 武士之灵×3 巫蛊师×1","二回合 骨女×4 傀儡师×1","三回合 二口女×5 清姬×1"]},
{"title":"清姬七层","rows":["一回合 首无×5 烟烟罗×1","二回合 判官×3 络新妇×2 人面树×1","三回合 二口女×2 鬼使白×2 凤凰火×1","清姬×1"]},
{"title":"清姬八层","rows":["一回合 小袖之手×4 烟烟罗×1","二回合 二口女×2 络新妇×2 樱花妖×1","妖狐×1","三回合 判官×1 鬼女红叶×2 鸩×1","傀儡师×1 清姬×1"]},
{"title":"清姬九层","rows":["一回合 赤舌×2 觉×3 薰×1","二回合 鬼使白×2 骨女×2 以津真天×1","人面树×1","三回合 鸩×1 鬼女红叶×2 两面佛×1","樱花妖×1 清姬×1"]},
{"title":"清姬十层","rows":["一回合 数珠×4 青坊主×1","二回合 孟婆×1 小袖之手×1 人面树×1","鬼女红叶×1 骨女×1 凤凰火×1","三回合 百目鬼×1 鬼女红叶×1 椒图×1 鸩×1 山风×1 清姬×1"]},
{"title":"雪童子一层","rows":["一回合 跳跳犬×3 寄生魂×1","二回合 帚神×3 童女×1","三回合 涂壁×3 雪童子×1"]},
{"title":"雪童子二层","rows":["一回合 灯笼鬼×3 提灯小僧×1","二回合 唐纸伞妖×3 独眼小僧×1","三回合 山童×3 雪童子×1"]},
{"title":"雪童子三层","rows":["一回合 盗墓小鬼×3 古笼火×1","二回合 天邪鬼赤×3 首无×1","三回合 天邪鬼绿×1 天邪鬼黄×1 天邪鬼青×1","雪童子×1"]},
{"title":"雪童子四层","rows":["一回合 寄生魂×3 武士之灵×1","二回合 童女×2 童男×1 食发鬼×1","三回合 饿鬼×4 雪童子×1"]},
{"title":"雪童子五层","rows":["一回合 跳跳妹妹×3 跳跳哥哥×1","二回合 萤草×2 蝴蝶精×2 椒图×1","三回合 鸦天狗×2 管狐×2 雪童子×1"]},
{"title":"雪童子六层","rows":["一回合 九命猫×3 犬神×1","二回合 骨女×2 吸血姬×2 清姬×1","三回合 桃花妖×2 三尾狐×2 般若×1","雪童子×1"]},
{"title":"雪童子七层","rows":["一回合 傀儡师×2 烟烟罗×2 彼岸花×1","二回合 座敷童子×1 山兔×1 姑获鸟×2","食发鬼×1","三回合 鸩×3 日和坊×2 雪童子×1"]},
{"title":"雪童子八层","rows":["一回合 觉×2 首无×2 惠比寿×1","二回合 蝴蝶精×2 管狐×3 樱花妖×1","三回合 匣中少女×1 黑童子×1 金鱼姬×1","跳跳弟弟×1 桃花妖×1 雪童子×1"]},
{"title":"雪童子九层","rows":["一回合 白狼×5 辉夜姬×1","二回合 鬼使白×3 鬼女红叶×2 清姬×1","三回合 跳跳哥哥×1 桃花妖×1 妖刀姬×1 鬼使黑×1 雪女×1 雪童子×1"]},
{"title":"雪童子十层","rows":["一回合 雪女×5 般若×1","二回合 兵佣×2 姑获鸟×3 童女×1","三回合 樱花妖×1 山风×1 犬神×1 小松丸×1 镰鼬×1 雪童子×1"]}
]
'''
业原火
'''
yhfbDataYYH=[
{"title":"贪之阵","rows":["一回合 萤草×3 妖狐×1","二回合 蝴蝶精×1 萤草×1 三尾狐×1","兵俑×1","三回合 业原火×3"]},
{"title":"嗔之阵","rows":["一回合 萤草×3 妖狐×1","二回合 蝴蝶精×1 萤草×1 三尾狐×1","兵俑×1","三回合 业原火×3"]},
{"title":"痴之阵","rows":["一回合 萤草×3 妖狐×1","二回合 蝴蝶精×1 萤草×1 椒图×1","三尾狐×1 兵俑×1","三回合 业原火×3"]}
]


'''
处理原始数据得到结构化列表
'''
monster = [] #妖怪列表
l = [] #结构化表
pointers = {"第零章":0} #指针组
counter = 0 #计数器

miwenList = ["红叶","妖刀","河童","雨女","荒川","大天狗","姑获鸟","镰鼬","小鹿男","海坊主","青行灯","吸血姬","妖狐","清姬","雪童子"]

'''
处理探索副本
'''
chapter = 1
for line in tansuofuben:
    for row in line["rows"]:
        row = row.split(" ")
        if row[0] == "挑战":
            continue
        else:
            row[0] = line["title"] + row[0]
            tmp = {}
            for j in range(1,len(row)):
                mon = row[j].split("×")
                mon[0] = mon[0].replace("\u200b","")
                if mon[0] not in monster:
                    monster.append(mon[0])
                tmp[mon[0]] = int(mon[1])
            l.append({"关卡":row[0],"妖怪":tmp})
            counter += 1
    pointers["探索" + str(chapter)] = counter - 1
    chapter += 1
pointers["挑战0"] = counter
challenge = 1
for line in tansuofuben:
    for row in line["rows"]:
        row = row.split(" ")
        if row[0] == "挑战":
            for j in range(1,len(row)):
                mon = row[j].split("×")
                mon[0] = mon[0].replace("\u200b","")
                if mon[0] not in monster:
                    monster.append(mon[0])
                l.append({"关卡":line["title"] + "挑战 " + mon[0],"妖怪":{mon[0]:mon[1]}})
                counter += 1
    pointers["挑战" + str(challenge)] = counter - 1
    challenge += 1
pointers["御魂副本"] = counter
'''
处理御魂副本
'''
for line in yhfbData:
    tmpMonsterDictForPlace = {}
    for row in line["rows"]:
        x = row.split(" ")
        for j in range(1,len(x)):
            mon = x[j].split("×")
            mon[0] = mon[0].replace("\u200b", "")
            if mon[0] not in monster:
                monster.append(mon[0])
            if mon[0] in tmpMonsterDictForPlace:
                tmpMonsterDictForPlace[mon[0]] += int(mon[1])
            else:
                tmpMonsterDictForPlace[mon[0]] = int(mon[1])
    l.append({"关卡":"御魂副本 " + line["title"],"妖怪":tmpMonsterDictForPlace})
    counter += 1
'''
处理业原火副本
'''
for line in yhfbDataYYH:
    tmpMonsterDictForPlace = {}
    for row in line["rows"]:
        x = row.split(" ")
        for j in range(0,len(x)):
            if x[j].find("回合") > -1:
                continue
            mon = x[j].split("×")
            mon[0] = mon[0].replace("\u200b", "")
            if mon[0] not in monster:
                monster.append(mon[0])
            if mon[0] in tmpMonsterDictForPlace:
                tmpMonsterDictForPlace[mon[0]] += int(mon[1])
            else:
                tmpMonsterDictForPlace[mon[0]] = int(mon[1])
    l.append({"关卡":"业原火副本 "+ line["title"],"妖怪":tmpMonsterDictForPlace})
    counter += 1
    pointers["业原火副本 "+ line["title"]] = counter - 1
pointers["秘闻副本"] = counter
'''
处理秘闻副本
'''
for line in mwfbData:
    tmpMonsterDictForPlace = {}
    for row in line["rows"]:
        x = row.split(" ")
        for j in range(0,len(x)):
            if x[j].find("回合") > -1:
                continue
            mon = x[j].split("×")
            mon[0] = mon[0].replace("\u200b", "")
            if mon[0] not in monster:
                monster.append(mon[0])
            if mon[0] in tmpMonsterDictForPlace:
                tmpMonsterDictForPlace[mon[0]] += int(mon[1])
            else:
                tmpMonsterDictForPlace[mon[0]] = int(mon[1])
    l.append({"关卡":"秘闻副本 "+ line["title"],"妖怪":tmpMonsterDictForPlace})

'''
生成妖怪矩阵
每一行代表某类妖怪
每一列代表某个关卡
'''
monsterMatrix = np.zeros((len(monster),len(l)))
for i in range(len(l)):
    for monsterName in l[i]["妖怪"]:
        monsterMatrix[monster.index(monsterName),i] = l[i]["妖怪"][monsterName]

'''
求解方法
'''
# [exploreMax, enableChallenge, yuhunMax, [miwenMax]]
# 探索副本，是否允许挑战，御魂副本，秘闻副本
def optimize(monsterList,monsterNum,exploreMax, enableChallenge, yuhunMax, miwenMax):
    # 获取妖怪行号
    # if type(row[0]) == str:
    #     rows = [monster.index(name) for name in monsterList]
    rows = monsterList
    # 取出关卡列号
    cols = [i for i in range(pointers["探索" + str(exploreMax)])]
    if enableChallenge:
        cols += [i for i in range(pointers["挑战"+str(0)],pointers["挑战"+str(exploreMax)] + 1)]
    cols += [i for i in range(pointers["御魂副本"],pointers["御魂副本"] + yuhunMax)]
    cols += [i for j in range(0,len(miwenList)) for i in range(pointers["秘闻副本"] + j * 10,pointers["秘闻副本"] + miwenMax[j]) ]


    #取出矩阵的这些行作为新的系数矩阵
    A = monsterMatrix[rows][:,cols]
    b = np.array(monsterNum)
    c = np.ones(len(cols))
    Aeq = None
    beq = None
    bounds = [(0,None) for i in range(len(cols))]
    solver = ILP(-c,-A,-b,Aeq,beq,bounds)
    solver.solve()
    print(solver.opt_val, solver.opt_x)
    for i in range(len(solver.opt_x)):
        if solver.opt_x[i] != 0:
            print(l[cols[i]],solver.opt_x[i])
    return {"combination":[[cols[i],solver.opt_x[i]] for i in range(len(solver.opt_x)) if solver.opt_x[i] != 0],"opt":round(-solver.opt_val)}

# optimize(["判官","鲤鱼精","河童","涂壁","灯笼鬼"],[2,6,13,10,13],14,False,8,[0 for i in range(0,len(miwenList))])